axelfurlan/arduino_stuff/ATTiny85/ATTiny85_deep_sleep_AHT21_and_NRF240L/RF24_mod.cpp
    config_reg = read_register(NRF_CONFIG);
    printf_P(PSTR("Primary Mode\t\t= %cX\r\n"), config_reg & _BV(PRIM_RX) ? 'R' : 'T');
    print_address_register(PSTR("TX address\t"), TX_ADDR);

    uint8_t openPipes = read_register(EN_RXADDR);
    for (uint8_t i = 0; i < 6; ++i) {
        bool isOpen = openPipes & _BV(i);
        printf_P(PSTR("pipe %u (" PRIPSTR
                      ") bound"),
                 i, (char*)(pgm_read_ptr(&rf24_feature_e_str_P[isOpen + 3])));
        if (i < 2) {
            print_address_register(PSTR(""), static_cast<uint8_t>(RX_ADDR_P0 + i));
        }
        else {
            print_byte_register(PSTR(""), static_cast<uint8_t>(RX_ADDR_P0 + i));
        }
    }
}

/****************************************************************************/

uint16_t RF24::sprintfPrettyDetails(char* debugging_information)
{
    const char* format_string = PSTR(
        "================ SPI Configuration ================\n"
        "CSN Pin\t\t\t= %d\n"
        "CE Pin\t\t\t= %d\n"
        "SPI Frequency\t\t= %d Mhz\n"
        "================ NRF Configuration ================\n"
        "Channel\t\t\t= %u (~ %u MHz)\n"
        "RF Data Rate\t\t" PRIPSTR "\n"
        "RF Power Amplifier\t" PRIPSTR "\n"
        "RF Low Noise Amplifier\t" PRIPSTR "\n"
        "CRC Length\t\t" PRIPSTR "\n"
        "Address Length\t\t= %d bytes\n"
        "Static Payload Length\t= %d bytes\n"
        "Auto Retry Delay\t= %d microseconds\n"
        "Auto Retry Attempts\t= %d maximum\n"
        "Packets lost on\n    current channel\t= %d\r\n"
        "Retry attempts made for\n    last transmission\t= %d\r\n"
        "Multicast\t\t" PRIPSTR "\n"
        "Custom ACK Payload\t" PRIPSTR "\n"
        "Dynamic Payloads\t" PRIPSTR "\n"
        "Auto Acknowledgment\t");
    const char* format_str2 = PSTR("\nPrimary Mode\t\t= %cX\nTX address\t\t= 0x");
    const char* format_str3 = PSTR("\nPipe %d (" PRIPSTR ") bound\t= 0x");

    uint16_t offset = sprintf_P(
        debugging_information, format_string, csn_pin, ce_pin,
        static_cast<uint8_t>(spi_speed / 1000000), getChannel(),
        static_cast<uint16_t>(getChannel() + 2400),
        (char*)(pgm_read_ptr(&rf24_datarate_e_str_P[getDataRate()])),
        (char*)(pgm_read_ptr(&rf24_pa_dbm_e_str_P[getPALevel()])),
        (char*)(pgm_read_ptr(&rf24_feature_e_str_P[(read_register(RF_SETUP) & 1) * 1])),
        (char*)(pgm_read_ptr(&rf24_crclength_e_str_P[getCRCLength()])),
        ((read_register(SETUP_AW) & 3) + 2), getPayloadSize(),
        ((read_register(SETUP_RETR) >> ARD) * 250 + 250),
        (read_register(SETUP_RETR) & 0x0F), (read_register(OBSERVE_TX) >> 4),
        (read_register(OBSERVE_TX) & 0x0F),
        (char*)(pgm_read_ptr(&rf24_feature_e_str_P[static_cast<bool>(read_register(FEATURE) & _BV(EN_DYN_ACK)) * 2])),
        (char*)(pgm_read_ptr(&rf24_feature_e_str_P[static_cast<bool>(read_register(FEATURE) & _BV(EN_ACK_PAY)) * 1])),
        (char*)(pgm_read_ptr(&rf24_feature_e_str_P[(read_register(DYNPD) && (read_register(FEATURE) & _BV(EN_DPL))) * 1])));
    uint8_t autoAck = read_register(EN_AA);
    if (autoAck == 0x3F || autoAck == 0) {
        // all pipes have the same configuration about auto-ack feature
        offset += sprintf_P(
            debugging_information + offset, PSTR("" PRIPSTR ""),
            (char*)(pgm_read_ptr(&rf24_feature_e_str_P[static_cast<bool>(autoAck) * 1])));
    }
    else {
        // representation per pipe
        offset += sprintf_P(
            debugging_information + offset, PSTR("= 0b%c%c%c%c%c%c"),
            static_cast<char>(static_cast<bool>(autoAck & _BV(ENAA_P5)) + 48),
            static_cast<char>(static_cast<bool>(autoAck & _BV(ENAA_P4)) + 48),
            static_cast<char>(static_cast<bool>(autoAck & _BV(ENAA_P3)) + 48),
            static_cast<char>(static_cast<bool>(autoAck & _BV(ENAA_P2)) + 48),
            static_cast<char>(static_cast<bool>(autoAck & _BV(ENAA_P1)) + 48),
            static_cast<char>(static_cast<bool>(autoAck & _BV(ENAA_P0)) + 48));
    }
    offset += sprintf_P(
        debugging_information + offset, format_str2,
        (read_register(NRF_CONFIG) & _BV(PRIM_RX) ? 'R' : 'T'));
    offset += sprintf_address_register(debugging_information + offset, TX_ADDR);
    uint8_t openPipes = read_register(EN_RXADDR);
    for (uint8_t i = 0; i < 6; ++i) {
        offset += sprintf_P(
            debugging_information + offset, format_str3,
            i, ((char*)(pgm_read_ptr(&rf24_feature_e_str_P[static_cast<bool>(openPipes & _BV(i)) + 3]))));
        if (i < 2) {
            offset += sprintf_address_register(
                debugging_information + offset, static_cast<uint8_t>(RX_ADDR_P0 + i));
        }
        else {
            offset += sprintf_P(
                debugging_information + offset, PSTR("%02X"),
                read_register(static_cast<uint8_t>(RX_ADDR_P0 + i)));
        }
    }
    return offset;
}

/****************************************************************************/

void RF24::encodeRadioDetails(uint8_t* encoded_details)
{
    uint8_t end = FEATURE + 1;
    for (uint8_t i = NRF_CONFIG; i < end; ++i) {
        if (i == RX_ADDR_P0 || i == RX_ADDR_P1 || i == TX_ADDR) {
            // get 40-bit registers
            read_register(i, encoded_details, 5);
            encoded_details += 5;
        }
        else if (i != 0x18 && i != 0x19 && i != 0x1a && i != 0x1b) { // skip undocumented registers
            // get single byte registers
            *encoded_details++ = read_register(i);
        }
    }
    *encoded_details++ = ce_pin >> 4;
    *encoded_details++ = ce_pin & 0xFF;
    *encoded_details++ = csn_pin >> 4;
    *encoded_details++ = csn_pin & 0xFF;
    *encoded_details = static_cast<uint8_t>((spi_speed / 1000000) | _BV(_is_p_variant * 4));
}
#endif // !defined(MINIMAL)

/****************************************************************************/
#if defined(RF24_SPI_PTR) || defined(DOXYGEN_FORCED)
// does not apply to RF24_LINUX

bool RF24::begin(_SPI* spiBus)
{
    _spi = spiBus;
    return _init_pins() && _init_radio();
}

